{
	"positive": [
		"Learning good practice and helpful tools from tutors through videos (e.g. data audit);",
		"Like the videos",
		"Clear and logical course materials - overall narrative within modules and across the course as a whole",
		"Excelent course and material",
		"I am already fairly familiar with the topic, so not a lot of new concepts, but there were some interesting tips for accessing public and/or free data, low-cost or no- cost tools, and good reminders about framing the story",
		"I found the material was well prepared and well presented",
		"I really liked that it provided the material that was a gap between the data and the narrative",
		"I enjoyed the course because the content was indepth and the videos were great intros to personal study/application",
		"It was relevant material.",
		"It was very interactive and good reading materials and excersices",
		"The course was interesting especially reading materials and videos",
		"The lecture transcripts were very helpful, but there were none for the last 2 modules",
		"The material is very thorough and the videos really engaging",
		"The videos are made so understandable and interesting",
		"the videos were excellent - clear and useful;",
		"A great variety of topics and interesting videos and articles",
		"Because the content was so great",
		"I enjoyed the corse, the readings and videos, they were usefull, interesting and fun",
		"Challenging material, but rewarding",
		"Doing the steps with the video, really help to understand the concept the instructor wanted to reach",
		"Great content, especially the introductory module",
		"Having videos and written materials aided my learning experience greatly",
		"Material was explained very thoroughly with clear real world applications",
		"Super clear materials to learn from. Learned more than I expected",
		"Video lectures were interesting, content was the right amount of challenging",
		"Videos were good, relevant, a lot of energy and sneezes from instructor; he was",
		"passionate about teaching the skills",
		"Besides I could read a lot of material dealing with the topic). The lectures on the processes related to the data handling were particularly helpful. Also the discussions about issues and challenges when dealing with",
		"I'm sure I amply covered this in the survey. As I said I found the experience- based video lectures helpful, and well as the carefully-curated readings (book chapters, web pages, online guides to graphs and charts, the offer of Tableau support)--all of it",
		"Great topic and interesting material. So useful",
		"http://www.firstpythonnotebook.org/ is great",
		"I can't say anytrhing, because The video has discourraged me to go further",
		"I really enjoy all the information I can access, and I learn a lot, I wish I had more time to make the most of it.",
		"The learning material is easy to comprehend. Moreover, the courses are very attractive to me. I want to swim in the sea of knowledge",
		"The videos was self-explanatory",
		"diverse methods of information intake (kinetic, audio, visual learning",
		"A good example is that the Mooc gave me more tools to think about the subject",
		"I like explainers videos as an introduction to the subject",
		"I think that the videos of the instructors were good and informative and carried out well",
		"The videos are very friendly",
		"With the video recordings I still got to see the faces of the instructors. The videos/discussions covered most of my questions so I never felt the need for face time with the instructors",
		"Many of the same benefits come from watching videos (well edited, concisely presented) as in an in person lecture. The learning and takeaways are fairly similar",
		"Using videos help and also the possibility of dialogue via mail",
		"I appreciated all the course materials. I can't think of a \"bad example.\" I did regret not having more time to spend on this course",
		"The content was very good",
		"The videos showing the different types of cameras and technologies (in action) were very helpful",
		"Good: Great contente Good: using jupyter notebook for the python exercises was a positive experience. This method is easy to follow and useful for saving and reviewing my work The combination of very clear notes in the course Notebook and super well- paced, clear and accessible videos was outstanding. I can't think of a single occasion where I didn't understand or couldn't find the answer I was looking for The different delivery methods - i'd rather read through a tutorial than watch a video. Ben does great documentation, but his videos were good too. So really good combo for different learning styles the FirstPythonNotebook documentation is very well-constructed.",
		"For the last few modules, the discussion forums and sharing were particularly rich",
		"I can not talk musch about this MOCC, but about other MOCC I follow, I like it all. Specially the discussion forum and videos",
		"in general, it was helpful to have a framework for understanding data sources and the pitfalls",
		"it made me take a second look at the art and science of data visualization, tableau and the potential for R programming",
		"To me, it was an excellent refresher on how to think through statistics and what they mean.",
		"Learn about Tableau and learn about good practices in visualization with Alberto Cairo",
		"Was able to learn tableau and get very comfortable with it",
		"(to learn) how easy it can be to mistakenly represent or deliberately manipulate data;",
		"To have professional training in be mindful of finding story or hook from some data collections.",
		"Experiencing VR and 360 on my iPhone and on the computer via the browser",
		"Guardian and the Euro News as it allows me to pitch to them from Pakistan using the same production tools as they do",
		"Tips to by equipment were very useful",
		"It's hard to remember/compare specific things, now it's >2months since starting. But...] I learned to setup a Python environment (and git repository), and where to save/setup future projects (including virtual environments) ...So that became something I repeated (and with R), instead of them being 'islands' of forgotten datasets Knowing a lot of things about python and journalism work possiblities learned about .reset_index() acting on a groupby() result Not specifically in the MOOC, but the MOOC inspired me to learn way more about the terminal. Took the codecademy course on it because of this MOOC",
		"Content",
		"For me, everything about this course was awesome and relevant for my job and life even though my field isn't journalism per se (it is related, however",
		"Relevance to much of my work",
		"Getting better exposure to Tableau",
		"Particularly like the section on \"ethics",
		"The amount of things still to explore - it opens \"doors\" to further study",
		"Though it is basic, the content is pretty useful. For beginners, I really feel motivated and have fun in data analysis",
		"Chance to try Tableaux a bit",
		"Although I already had some experience in data processing, I was new to both journalism and formal expression of its ethics rules, Tableau, statistics and the kind of data manipulation of the course.So, new, formal knowledge helped organize older, scattered related pieces in a new big, very interesting picture",
		"Bearing in mind that I do not currently do this type of data analysis, data",
		"visualisation and storytelling for work, this was a great introduction. I have done research before, but not into this type of material. Useful things included: data biography, some of the source evaluation, exploratory data analysis, cleaning log, brief excursions into statistics, uses of different chart types, non-neutrality of charts, ethical considerations at each stage, demonstrating that the demand one sometimes hears to understand something \"at a glance\" in a chart is unrealistic, handling complexity, how the storytelling aspects fit in, things to watch out for in dishonest charting and visualisation, limitations of data or visualisations, challenging misuse",
		"Better and different way to use Google for searches and queries",
		"Data journalism is new to me. I just heard about the concept in passing from a colleague and then did a bit of digging online, but it all looked so complicated. But when I did the MOOC, it didn't feel as complicated, it seemed simpler; though I was challenged to work more on it and even explore data stories. I am an upcoming journalist and I haven't cut out my niche yet, but data journalism seems to interest me. And now, I am not afraid of using Tableau ‰ÛÓ I'm still getting the hang of it and I'm sure I'll be able to do good stories using it, especially on health matters",
		"I felt like I was learning things that I could actually use now and later in my career so that helped. I knew some about data collecting and how to find stories from that but learning what exactly to look for in data and how to take out things that don't matter to the story was very helpful moving forward",
		"I have not yet worked directly with data in my journalism career but this MOOC was done very, very well by providing me with a sound knowledge of how to add data elements. It was also very well done by providing students a great basis on where to find data, how to use data, the ethical issues with using data and the online tools we can access to enhance our stories",
		"I have travelled a lot during my studies in University so I have gained English as almost for my second language. I have been more in to qualitative research before and quantitative data analysis became more understandable to me in English bcs I didn «t get it quite yet in Finnish while I was studying - the coure was really good recap for me",
		"I know everything there is about Excel but I haven't used tableau before. So I watched the videos twice and it really helped! Also I really enjoyed the courses about visualizations and If I have the chance I want to learn more about that in the future",
		"I learned good practice and a sound theoretical background, using interesting real-world examples",
		"I learned more about visualizations and which ones are more effective to tell a story, in addition all the teaching material was excellent",
		"I learnt about data but not in a statistic emphasis manner",
		"I like this subject because i need use in my work",
		"I really appreciate the mooc, because i learned important things about data journalism",
		"It helped understand the ethics of using data or not using data. The positive and negative sides of manipulating data for a story",
		"It was more about opening my mind to learning new skills - data analytics using tableau, R, infographics and data visualization tools",
		"Learned about relationships between variable and correlation. Learned how to use tableau public.the best part was actually all the great sites that I now use as references and review. The course gave a big picture outlook as well as details with supplemental readings",
		"Some of what I learned is how much more I need to learn. The way data is made available presents a whole lot of challenges and my lack of familiarity with Tableau Is something I need to address. It was great to have easy access",
		"because of the course to the people at Tableau as I sought help with organizing campaign finance data because I had entered it in a form that wasn't working for me",
		"What I liked the most was the chance to learn the basics regarding the practice of data journalism (beginning with data cleaning, finishing with the writing of the story",
		"As mentioned above, I was able to make valid choices for investment. Then the course gave me the confidence to launch my own startup Immersive Journalism Portal, the first in Pakistan and am now near the launch of it. In the same vain, the details of the do's and the don'ts helped me with my own production processes. I have finished shooting 25 different short reports and one 30 minute VR Video documentary film on the Lahore Walled City because I was confident I can do that. The production process is now almost over and the post is about to finish. Once it is done, I am going to use these properties to launch my startup www.vr360.pk as these will help me make my mark by becoming visible as an accomplished producer in Pakistan",
		"Como Periodista, considero estos conocimientos de gran ayuda para el desarrollo de materiales en nuestra Ì rea",
		"I knew nothing about 360 video and very little about immersive journalism prior to taking this course. I believe I gained a good introduction from the MOOC",
		"It clarified what VR Horunalism is and answered many of the questions I had about the platform",
		"It is correct, the information and the methodology offered in the MOOC allowed me to enjoy a very attractive way of learning",
		"I've never heard about immersive journalism before. I work in print journalism. I could learn how to produce a new kind of content. It is good in my movement to go digital",
		"Much of the course delivered first-hand experiences in the creation of immersive journalism, showing what works well in particular situations and what does not work as well",
		"New technologies & trends",
		"The course pointed out key definitions in immersive journalism and helped me to clarify the differences between VR and 360å¼ videos",
		"The mooc gave me some very good new information about VR, with some things I've already knew, and many others I didin't",
		"The subject was awesome, new, interesting",
		"This was my first experience and I purchased 2 360 cameras from the_",
		"information I learned in this course. In the future I hope to purchase or use some of the software mentioned in the course",
		"VR is a new area of exploration. The content was very helpful in understanding the history and the challenges of moving forward.",
		"we were asked to conceive of how to actually the tools in our situation",
		"We were considering a project that would allow us to try VR as in expensively as possible. Listing costs for specific technology was so helpful to get a better sense of what it really takes to procure that equipment",
		"A saw many practical ways to improve journalism daily tasks",
		"Again, i typically work with data similar to that in the class. In the past, much of my work has been in PostgreSQL or Excel. I'd be curious about what those with less data analysis experience had to say about this",
		"And I could see the real-world applications of this stuff in my day to day work. That made it seem useful and exciting",
		"Every topic it's fine",
		"I am no python programmer, but I did have some very outdated programming knowledge and lots of interest in data journalism. The mooc 'opened the gates' for me, so to speak",
		"I guess people who are taking moocs from the Knight Center have already some background in the topics that are offered. At this moment I dont practice journalism that much but I keep the drive to stay thinking and acting as a journalist. I had some knowledge of python before but not applied to journalism. So this was an excellent opportunity to apply some elements I knew a little (pandas) in an application that could be applied afterwards in a professional way.",
		"Using Jupyternotebook was new to me and i got real satisfaction from understanding and being able to use it in a journalistic approach",
		"I'm a designer and the owner/creative director of a small design studio based in Rio de Janeiro, Brazil. Our main work is information design, especially interactive data visualization so the MOOC was a great way to get a sense of how Heather and Alberto think and approach a data visualization assignment, as well as to get some backstage insights.",
		"Personal interest in what the course was about, trying to learn new things",
		"At the moment I do not do formal data analysis and monitoring or quality assurance reporting. However, I am aware this stuff happens, and this MOOC had some applicable things. Useful applicable things include: ethics, exploratory data analysis, data biography, different charting and visualisation considerations, what the story is or could be, some fuel for thinking about business intelligence dashboards, food for thought on presentations and reporting",
		"Data visualization tools",
		"Facts and data have been greatly mistreated in Greece, lately (the financial crisis happened partly as a result of people not understanding, not caring about even the most fundamental economic realities). Plus, there has been plenty purposeful misinformation for political reasons",
		"I am not a journalist. I work in management information systems. I do research, calculations, data collection form specification and design, some information extraction and reporting, data cleaning, try to keep up to date with funding policy - that kind of thing",
		"I expect that, as a journalist, I will need to use data at some point in my career. Therefore knowing the techniques for interacting with data are useful",
		"I like to learn new things related to data and visualizations",
		"I need learn for Fact Checking",
		"I wanted hands-on exposure to Tableau Public and/or other data viz tools (both for personal edification and for resume-building). I value journalism and find its methods and practices interesting as a spectator and as a potential part-time amateur practitioner",
		"I wanted to learn more about doing data viz. There was so much content, it became a game of copying information and storing it. Other students besides myself thought they might get back to it this summer",
		"My interest for the subject and the flexible schedule",
		"My motivation was to use and learn tableau to participate in an organization called Data for Good",
		"My primary motivation was interest and wanting to learn more. Data journalism is a new concept that has not been thoroughly explored in my country. I want a new and exciting way of telling stories. I get attracted to stories that have graphics and learning how to do my own visualisations was an eye-opener. Every video had something new to learn and I can tell you that the course instructors kept us on our toes. The content was also exciting, so at no time did I feel the need to quit. I just wanted to learn more. In fact, sometimes I would finish one module early and be eagerly waiting for the next because I just wanted to know more and more",
		"New information",
		"Storytelling. It shouldn't be only text",
		"The course was recommended from a former librarian in an association I belong to. While I am not a journalist/reporter, I am a high tech investigator and work with big data, research and at times having to understand information flow of large amounts of data. I question everything, this course re-enforced my ideas of the importance of questioning and researching what I believe to be the answers",
		"To gain practical skills in journalism. New information being disseminated in easy chunks. I look at data presented in multiple ways",
		"Fun, out of my usual scope",
		"I was coordinating a 4-month learning session related to stories with data. I have purchased books on data visualization, R programming and downloaded tableau. I plan to work on them over the summer",
		"I was in a period of transition..having been recently laid off. This class was a way to keep skills fresh and like I mentioned earlier -- it was like a refresher course on data wrangling/cleaning and statistics, and how to share results of data analysis",
		"I'm a blogger. I got there after an academic career, so I don't have journalism training. The class reinforced that I was doing things reasonably well and gave me specific tips on ways to improve",
		"I'm interested in changing careers (I'm a k-12 teacher) and data journalism is an exciting option. This course was just the beginning. In the near future I plan to review the whole course and practice with data",
		"Learning to use a new software and recap of my already existing knowledge on the matter, it was also nice to have group discussions online and all in all the course was really interesting bcs it was the first MOOC I participated in",
		"Primary motivations: Alberto Cairo as an expert tutor, personal development",
		"The idea is to learn more, to have more knowledge and more ability to do data journalism",
		"As I said before, I had studied some Python before. But Jupyter seems like a good way to document my progress step by step and keep the steps for future reference",
		"Cause I love journalism. I think data journalism is very interesting",
		"Data journalism in general. I'm working for a proposal for an open data site for the near future and, even if this course is not all I need, it gave me a good start",
		"I wanted to try some software with which I was only vaguely familiar and to do so under a teacher that I admired. This class fit the bill. While I won't use Python and its libraries",
		"I was drawn to the description of the course. In particular this paragraph: aYouare going to learn how to do every step in preparing, conducting, executing and then publishing a data analysis with Python and the Jupyter notebook, which is the tool that lets you document your code and then publish it,a? Welsh explained",
		"It described exactly something I wanted to learn how to do",
		"It is that journalistic drive to reveal something, to understand things, to go after the bad guys. Also the interest to get skilled in datajournalism and to find inspiration in the work and results of others with the same interest. I always learn new things from this and previous moocs",
		"Personally I am interested in learning data science using python. Fortunately I got to know about this MOOC. Though initially it was my personal interest to to the activities, later down the line the topics and the case studies given in MOOC gave interest to explore more on it",
		"Python/ Data analysis contente",
		"Take a look in the far field of computer programming",
		"To learn about Jupyter notebooks and Pandas. I work primarily in SAS but work with researchers who are moving to R and Python. So I wanted to 1) move some of my processing to Python, and 2) understand more about what they are doing and need from me",
		"I am interested in improving my analytics skills using PYTHON. This course met my needs. I have been able to download a data set from CMS.gov related to healthcare spending and analyze it using PYTHON",
		"I finished because I wanted to learn more. Unfortunately one 12-week lesson isn't enough for someone to feel completely comfortable. However, what I learned was enough for me to want to venture out on my own and practice",
		"I had friends recommend this course and since I'm retired, I have time on my hands. Frankly, I wanted to see if I could handle things after being out of the field for a decade.I have a current long-term project",
		"I'm a student and I'm looking at branching out into data journalism. I am looking at as many methods of data investigation as possible",
		"My motivation was to improve my skills using Jupyter/pandas because that's what i'm trying to use for analysis these days. Here's an example of something i put together shortly before the class began: https://github.com/sandrafish/NMlobby",
		"I have been very slowly learning to code using Python. The learning materials I'd used up until this MOOC hadn't covered using Python, Pandas to interrogate data in a journalism context. The MOOC gave me a familiar context in which to learn some more coding skills",
		"I've read a lot about using Pandas but I hade never tried it myself. I found it really good and easy to learn",
		"Learning what tools/processes were used by someone/organisation I trust/admire was a valuable 'data point'. Using them in a 'real environment' (rather than simplified, browser-based examples) gave me something I could use in future",
		"Python for data journalists was my start in the journey of data analysis and more courses for data analysis will be grat",
		"The project focused approach promoted learning ",
		"It helped me starting practicing what I learn",
		"Doing the exercises helped me make sure I have understood the material. The exercises themselves where not teaching me anything. However, they helped me organize my thoughts on the issues and clarify terms, cases and subtle differences between them",
		"Helped me to gain an overview of how data journalists operate & the tools & techniques they use",
		"Helped: encouraged me to critically approach the course materials, reflect on my own experiences/opinions, and expose myself to other points of view",
		"Helpful",
		"I also wanted hands-on exposure to Tableau Public and/or other data viz tools (both for personal edification and for resume-building) and found the context helpful. They helped me learn, uh, by giving me more information and experience? I don't understand the latter part of the question",
		"The exercises made me see what areas I did not understand well and I went back to the videos and readings to try and understand it more",
		"The exercises trainning for application what you learn in text and video",
		"The reason was simple. It was practical knowledge and necessary to supplement my career and work in near future",
		"To try to test my understanding of the teaching. These exercises help me to review the previous days' reading and study of certain topics, so they are very beneficial, as well as encouraging for me to continue on learning the next module",
		"What I said before I used this course to complete my infograph and what I learned I used that on my daily newspaper",
		"What motivated me was the ways that I could implement what I was learning in the work that I do. The fact that I could use these new things in real life helped me want to participate and have those skills going forward in my career. After watching a few of the videos, I would go and use that to create a new infographic for work and that helped drive the lesson home",
		"Also, to pass for my students new information about it. The exercises helped me to learn by challenge me to thonk about the subject in relation with what I'm researching just now",
		"sample, useful and quick",
		"Exercises made it compulsory to study your materials carefully and watch the videos with total attention.",
		"The exercises prompted me to read all the lectures and watch all the videos",
		"Because there was practical exercices, thanks Californians NGO",
		"All in all, I basically completed the exercises because I wanted to complete the course. I had studied some Python, Jupyter Notebooks felt like a good way to practice and Pandas proved to be the best way for me to finally ditch Excel. The exercises were important to focus",
		"And the exercises were useful to test different skills acquired reading the extra content",
		"I have completed all exercise and I took them once. Usually the questions in the moocs are not that difficult but they make me curious and make me want to know which aspect or element from the course will be questioned. In that way one can discover something that has been overlooked",
		"The exercises were challenging enough to promote learning of the functions and commands in python",
		"In general, I find exercises a challenge, when yours answers are correct, it proves that you have indeed learned something or that you have overlooked something that might have been more important than you expected",
		"It helped to fill gaps if any from the class room",
		"The excesses helped me learn and truly get the material. I think if I had just watched the lectures and not done the exercises I would have forgotten everything immediately",
		"Academic honesty. Again, no, I did not learn anything new",
		"I didn't feel it was necessary to aid comprehension of the material provided in the video",
		"The exercises mean that I had to look at info that wasn't covered in the lesson. This helped me to explore Jupyter further",
		"The exercises were a test of memory & understanding, a reminder of workflow and why we chose certain analyses, and a prompt to check out (and comment on) others' work & findings/ problems",
		"First class on Tableau by Alberto was amazing",
		"walking through good and bad examples of graphs using real-life examples with Dr. Cairo",
		"Heather Krause",
		"Instructor Heather Strauss - very easy to learn from, straightforward info",
		"Instructor Krause",
		"Because Cairo is the best",
		"Enjoyed Instructors approach to material",
		"Heather did an excellent job in explaining how to interpret data",
		"I could learn with great experts in the course's topic",
		"Both Alberto Caira and Heather Krause were very patients and genuinely interested in their work",
		"I felt I learned a lot from the course both through new knowledge but also by having ideas reinforced that had previously been a bit vague or theoretical. I found the instructors to be both engaging and knowledgeable in their topics and came across in the videos very well. I generally found the technical level of the course to be about right, however, the technical aspects didn't translate into the videos as well as they could have. The demo's given using Tableau, for instance were particularly hard to follow and to replicate using a public only version and often ended up causing a lot of frustration as I struggled to get the same results or displays that the instructors were showing. I also found, as the course is journalism driven, that the discussion questions were limited for me as a non- journalist and there would generally only be one of the three that I felt in a",
		"position to contribute to",
		"I really like the way Heather Krause explained all the stuff with sketches.",
		"I would have gotten more out of the course material if I had a dual monitor system set up at home, to watch and then copy Heather as she walked us through Excel or Tableau Public. I especially enjoyed Alberto's explanations of graphs and fun data stories (drawing with interactive scatterplots, excellent examples of data journalism) and his clear explanations of errors made so we know what pitfalls to avoid. Heather drawing on the screen was really helpful for me conceptually; I wish those drawings could have been rendered in the transcripts",
		"Instructors are dedicated to all coursework in terms of the materials they uploaded and shared. You can find it with thier hangout records to the students how they think and concern regarding the topics, subjects, and further information about the conference to be held coming soon. They fostered to participate in it and let us earn better experience",
		"Instructors were great",
		"Instructors were very good, as was the content",
		"high quality instructors",
		"The instructors were great at providing resources and explaining materials",
		"the instructors are excellent and so is the material",
		"The instructors were very clear and straightforward about the topics and avoided using too many technical words. Besides, all the examples were good",
		"The instructors were very engaged and I liked the lectures and the reading materials",
		"both of the instructors",
		"In addition, instructors were very kind, organized, clear and to the point",
		"the instructors were knowlegable and good communicators",
		"This is an area that I touch on in my own work, so it was good to be able to take the time to follow a structured curriculum and focus on learning more. I very much enjoyed the way the instructors presented the material and that I was required to interact with other students on the forums",
		"Both instructors were excellent. I got out of it all that I wanted",
		"Had great professionals talking about their experience",
		"The professor was enthusiastic and he spoke very clearly so there were no problems in understanding",
		"A good level one the course and a superb instructor with easy to follow instructions",
		"Ben is a great instructor - well-organized, great written and video presentations, good explanation of what you're doing and why",
		"Ben is a great instructor who presents things in a highly organized manner. It also helps that my focus is on this kind of data",
		"Ben presented the materials in a very easy way",
		"Ben Welsh is an excellent teacher. I've had other python instruction and this is the first time all of the pieces made total sense",
		"Great instructor, helpful topic",
		"great topic, great instructor from a reputable publication, just a great course and a lot of fun to learn",
		"I felt the instructor has a gift for simplifying complex subject matter (computer software, Python) and making it available to newcomers in the subject",
		"I got new tools in a easy and interesting way. I worked with pandas before so the course expanded my knowledge . Ben is an amazing instructor, he is so patient at showing how the exercises are done. He not only show you step by step how to get things done but tells you interesting and useful things about differents topics.",
		"He is great",
		"I really enjoyed the instructor and he broke up the lessons. I also appreciate how he presented how this class applies to news stories throughout the class",
		"The instructor explained the material clearly and completely and had an easy, appealing manner. He was very motivating and found ways to make the material relevant",
		"The instructor is very engaging and explains things clearly. And, being a California reporter, it was exciting to use Cal-Access as the data source",
		"The instructor was very good and clear, with repetition when necessary. I liked that there was plenty of text alongside the videos - I always watched on the firstpythonnotebook site with the text",
		"The instructor's ability to convey information was excellent. I LOVED the fact that you had both a video or a webpage that you could get the exact same material from. I also TRULY appreciated all the additional readings. It gave a depth to data in journalism that I otherwise wouldn't have gotten",
		"It's different. I think in this case the instructor was very clear. It's difficult to explain everything and there are too many people. I prefer face to face classes but this was a great opportunity to access this type of courses given by prestigious universities and profesionals",
		"Professor",
		"as participant I could experiment on my skin what the instructor was explaining.",
		"Good: Access to two great faculty members who are on the cutting edge of the field.",
		"the mixed media approach, and instructors were very engaging",
		"Ben got me started with python where others had failed",
		"lecturers, because they were clear, interesting, and very helpful. It was evident the lecturers knew their topic very well and had the experience to know how to teach it",
		"Nice teachers",
		"I liked the specific country examples Heather used as she explained how to use data on Tableau. It made it feel real, and not just working on plain data but relating it to the specific human interest issues",
		"The way Heather went through her processes slowly and very exact was a great way to learn what she was talking about. She didn't just say, 'Do this', she showed how it would be done and I think that helped a lot",
		"The possibility of learning with the best teachers in each subject",
		"Ben's pace was really perfect, and he did by showing and telling",
		"I have had a lot of trouble figuring out github. Ben provided the best basic intro to git that I've ever had. He took us through it step by step, making it easy to understand. Thanks to his instructions -- which I've written and saved -- I don't think I'll get lost in git-world again",
		"The directors were excellent and I really wanted to learn more",
		"Through learning via this mooc, I have gotten some ideas i might work out later, so, this and previous moocs of Knight Center, are inspiring and stimulating. The way Ben Walsh guided the students through the course was very helpful and allowed to build up new knowledge and skills.",
		"Both instructors - Alberto and Heather were very personable and engaging",
		"Hmmm...not sure I indicated this. However, I can say it was such a positive experience due to the atmosphere of openness created by Alberto and Heather -- sharing talks, videos, resources...and encouraging all of us to share",
		"The instructors were very personable in the videos and did a great job covering all aspects",
		"The level of teachers and team",
		"I liked Krause, not the other instructor. I found him and his readings too hard to follow",
		"Not fair to have to choose. This instructor was excellent. There was a ton of great material, well-presented",
		"The Professor produced good videos, as he was teaching us in class. I enjoyed the way he interacted, even it was in an e-learning way",
		"The teachers have a positive thinking and are very clear in their talks",
		"Again, similar to motivations -- I learned through the participants who were sharing \"real world\" experiences, as well as through the material covered by both Alberto and Heather. It was a great refresher course -- for instance, I am really glad Heather covered the basics on keeping notes on any changes made to the raw data to refer to later if there is a need to recreate. Then as you read through the other participants responses to issues or suggestions for keeping track of changes -- you were able to get additional helpful hints",
		"Because the instructors were able, in a very understandable way, to explain the subject both theoretically and practical",
		"I always enjoy learning a new thing whenever, but in time a got a direct chance to learn from the Great Professor and the Tutor was too good and examples was very useful to gain",
		"I can say it was thanks to dedicated professors efforts on giving good quality of feedbacks and sharing various contents such as their hangout conversation on the current issues on data visualization",
		"I learned a lot from Heather's concrete examples and walking through how to do various practical steps, e.g., clean data, manage your sources of data, etc. While that kind of information doesn't have a WOW factor it is really helpful for someone to start creating work",
		"I like the direct, clear, structured and phased way that knowledge is transmitted",
		"I took the MOOC because I expected it to be at least half taught by Alberto",
		"Cairo, and to be different to the previous visualization MOOC I followed with you. I was disappointed that Cairo's segments were so brief, so similar to his lectures in the previous MOOC and - frankly - they felt rather perfunctory in their delivery and content",
		"It's been a long time now. Maybe that's the point - what do we still remember? The profs gave very specific, practical advice on things - the ethics portion was particularly helpful, but also the ways to think about one's story and steps in investigating",
		"It's been too long for this survey so I don't remember exactly what I thought was most significant. Heather and Alberto were great and were able to enrich even the most basic subjects, the ones I was already proficient in",
		"The examples made by the teachers helped a lot to understand the subject",
		"The teaching of the tutors are excellent and lively, thus I enjoyed a lot. Indeed I've been following Prof Roberto's earlier online course a few years back so I was attracted this time by his reputation and way of teaching",
		"The tutors were likeable, knowledgeable and clear",
		"I really enjoyed the way the teacher got involved in classes, even using the latest available technology",
		"professional instructor",
		"The professor did a great job of sharing the various types of technology to help us achieve what we want to do in our respective areas of discipline",
		"I had dabbled in using notebook before, but as a rote exercise. It wasn't really explained to me what each step did. This was a much better learning experience",
		"It was very thoroughly taught, from installation to actual usage.It's all blending together",
		"The teacher was excited about the material, which made it fun to learn",
		"A chance to learn from Alberto Cairo attracted me the most.",
		"This MOOC has given me an opportunity to learn from expert(Ben Welsh). As a instructor he had done a great job in letting the participants know how the data science is applied in day to day journalism. This excited me, as I can see the things in practical scenarios",
		"Let me think of a reason I haven't given before. Hm. Classes were good. Videos were very well explained",
		"great to access continued training through a free resource",
		"Course was well organized and planned out for students of all experience levels and backgrounds",
		"Free course, great instructors, a different view from other courses I have taken so far, especially because of discussions about ethic in data journalism",
		"I am a professional researcher and the content covered is the essence of my job, but it was presented in a great way: concise and easy to understand, also I liked the emphasis that was put on the ethics of data presentation/interpretation",
		"I am enrolled in the udacity data analysis nanodegree, which has great teaching for tool but little discussion of data quality, ethics, and story development",
		"I felt the course was really great. Just the right amount of information and the right amount of work for someone trying to fit this in while working",
		"I think it was a very well managed course. I got what I expected and the process was so smooth. The course offered solution to a lot of issues I, as a working journalist, face while dealing with data",
		"well-structured, excellent materials, clear explanations",
		"Accurate sources, summarizes, analysis and an excellent structure of the course",
		"Because the content is extremely accessive and the way that the information was exposed is very interactive",
		"There was a new topic with experienced instructors and students, so there was too much to learn. The content, interaction and activities made the 'enjoy', and also the personal interest in VR and 360 video",
		"Because it was well structured to covey knowledge by doing",
		"I liked the structure a lot. The topics covered and the sequence of the course made a lot of sense",
		"It was well organized and easy to follow. It reinforced things I already knew and advanced on new topics",
		"free  ",
		"Class time can be focused on content and explanation and doesn't have to worry about everybody being able to follow, which potentially slows down the classmuch easier to do, since I don't need to travel or set aside a particular time",
		"The opportunity of being able to enrol the course without being pshycally attending it",
		"very well done and well organized. Thanks",
		"I enjoyed the course because of the content, but especially the message boards. You were able to see people opinions and thoughts. However it is sometimes difficult to value the validity of classmate responses without the instructor weighing in. I also think as a very \"grey\" field such as data journalism, there is",
		"rarely a right or wrong idea or response",
		"I learned new things and new sources as well as making new friends among my peers around the world",
		"It is amazing that you can have access to instruction from experts, at no cost, concerning an area as interesting as data journalism. Sometimes, the videos felt longer than they needed to be, but overall, I have no complaints",
		"It was a great learning experience, although it is not an area I work with currently",
		"It was a great opportunity because I live far from great cityes and here I have no places to study more about journalism like this",
		"It was a new experience, and very unique at that",
		"It was great for me, coming from a prestigious university without tuition fees but yet, very qualitative at this time of great economic recession in my country",
		"It??s fantastic to have access to a course like this. I really want to develop as a journalist yet find it difficult to do so due to working conditions, the economic reality of the media business and the fact that my time is not always my own. This course is really good",
		"Many interesting details and bits of technical knowledge to gain. The readings and resources were very good and I saved them. I enjoyed comments from other students the most--Knight attracts many excellent journalists from around the world and I would have loved to get to know some of them better",
		"The content was relevant to my current job and was in short-interesting videos that I could access when I had the time",
		"I learn a lot in this course, because I had access to great content in readings and ideas. Also in exchangins with other people and instructor",
		"It was a great experience",
		"its a new experience where you learn in a fun way and a modern way",
		"It's a great way to learn",
		"I enjoyed the format - mix of the short video, student comments, reading and instructor interaction. More specifically, it made me take a second look at the art and science of data visualization, tableau and the potential for R programming.",
		"I liked that it was self-paced, but with deadlines",
		"Because it was well structured, easy to follow, with hands-on approach and useful",
		"Content is easy to follow and progresses in a logical way",
		"the organization of the course, dynamism",
		"The pace",
		"MOOC's team dedication",
		"I really enjoy all the information I can access, and I learn a lot, I wish I had more time to make the most of it. So in a previous question asked not to close access to each course because one can go reviewing the information sometimes at a more pleasurable pace",
		"The videos, communication and passion throughout the course is what made the difference. You can have a f-to-f with an instructor, but if you don't have the communication or passion for the subject matter, then you can lose the whole purpose of the course",
		"Face to face instruction requires extra time and money to get to class and a flexible schedule to fit that in",
		"The videos, pdf files and the discussion rooms are all very effective",
		"Could engage with MOOC elements such as reading, videos, tests and forum questions at times and location which suited me. I could dip in and out, reading and responding to forum comments multiple times during the week",
		"Lectures and the forums made the experience similar to F2F instruction",
		"Ben's pace was really perfect, and he did by showing and telling",
		"Good example was the pace of learning",
		"Of course some sequential in time is usually much longer than actual interaction in real classroom, it makes me more into the course and deepen the understanding",
		"Maybe not better than f-to-f, but mainly as great as f-to-f instruction, because some issues as: videos from the instructor; online meetings through Facebook (with the professionals); other videos and readings",
		"Dealing with the MOOC system was easy, uncomplicated, and anyone can work on it smoothly",
		"For this subject, which involves digital content creation, the online platform is naturally a good fit",
		"The forums were nice to exchange ideas, simulating the class",
		"Liked videos, readings, examples, connection with teachers, challenge of quizzes, - discussion forums were OK",
		"The course was well-paced with a manageable weekly commitment",
		"I wanted to get started with python after several failed attempts at home alone. So that was job done. As a trainer I am always interested to see what Knight is up to",
		"Learn from the best experts. Also the dynamic, engaging and interactive way to learn",
		"it was also nice to have group discussions online and all in all the course was really interesting bcs it was the first MOOC I participated in",
		"Since I belong to a conflict zone where we are often caged, if our internet is not stopped, MOOC is a best way to complete the education. I am strong advocate of MOOC",
		"I took the course at the same time as my youngest son, who is an avid gamer and interested in careers involving VR, AR, and immersive experiences. Having not chosen to pursue a traditional degree program like his two older brothers, I hoped that MOOC would help bolster his online learning skills. It did",
		"It was actually a very generous offering by the Knight Journalism Centre and the Texas University making it possible for someone like me to join and finish the course without investing any money in fees etc. It was a big factor for me and a real hurdle for most, I imagine. The only other courses that might be considered at par with our MOOC are all priced at over 400 dollars each and none is as comprehensive or foundational as this has been",
		"The MOOC was pitched at too slow/low a level. I would be interested in taking a more advanced class",
		"easy platform",
		"It was well structured",
		"The information was clearly presented and the length of the course met my attention and learning content goals in VR/AR/MR and 360",
		"Cause I can go to the MOOC when I Want. In any day or hour",
		"I found the repetition in the videos was a good reminder as we went along, but being able to skim/review the text version later was also helpful",
		"Learning was linear and sequential, requiring repetition at each step of the way",
		"The pace was great for someone that works full time like me. If I couldn't finish during the week, I had the weekend to catch up. One lesson per week was fast enough for me to not forget what I had learned the week before",
		"I am interested to know more about quantitave data anaysis bcs I want to do reseach in the future",
		"As a content researcher, was very interested to gain a better understanding of data analysis",
		"Although I deal with data as part of my job I don't have to do any statistical work or visualisation work myself. I do have some technical reporting colleagues who build dashboards and reports, and that sounds more interesting though I am not an SQL report writer so cannot readily transition to that side at the moment. (They tend to pack the job description with formal computing and programming and scripting essential requirements, rather than analysis). Visualisations are increasingly common, and I really wanted to understand why, particularly since there are so many bad ones out there (misused by marketing and propaganda folks). I wanted to learn more about good data analysis and good data visualisation, and I have plenty of leads on that now. It's not that one cannot go to a library and find some good things on this, and rummage around the internet and find good things on this - one can given enough time and patience to sift through the dross looking for gold...but this type of course is in many ways a better starting point. It is curated and filled with/by authoritative sources with plenty of signposts to more material and more avenues for further exploration and more in depth study, whilst being honest about any areas left out or simplified for purposes of the course. I really enjoyed the ethics aspects, and felt those were missing in some of the data and Excel related things I had looked at previously",
		"Because i am learning work with data fiding and plot",
		"Because I want to learn more about storytelling. I loved this profession and its my passion",
		"I am not a journalist and I thought that it would be interesting to learn how those charts/graphs are made in some of the articles that I read. I also realized that I could use what I learn on my job, as one of my projects now includes data visualization for internal higher ups. I think that I have learned a few things, and I hope to apply them going forward",
		"I learned a lot because I wanted to learn how to interpret the data. Data makes your story reliable",
		"I like to learn everything about journalism; therefore, I enjoy this course",
		"interested in subject matter",
		"It is a field that I would like to explore and this course really dugged into it",
		"It is a topic in wich I am very interested, and that I hadn't had the opportunity to dig deeper into it",
		"It was very interesting for me",
		"It was was really relevant to my interests",
		"It's something I am interested in",
		"Learn about technologies and journalism is my passion",
		"The topic is personally interesting and I enjoyed the presentations by both instructors",
		"this course is not connected to my profession directly. I wanted to learn something new. I wanted to understand how does data journalism \"work\" in practice.",
		"Took course as introduction and curiosity of subject",
		"Wanted exposure to Tableau and general overview of what's involved in the data",
		"exploration/journalism field.",
		"Because I think it was interesting and necesary for the journalist workers",
		"Because I very interested in this technology and the new horizon that bring us to storytelling in journalism",
		"I'm not new to the world of VR so I learned some new things. And the online discussions were an extra bonus.I enjoyed it very much. The topic has my interest and it showed me that I'm moving/developing in the right direction without losing my creativity",
		"It was relevant for me and my job",
		"I've been curious about VR journalism and this course helped get a thorough understanding of where things stand right now",
		"relevant to my interests and where we want to go in our department at Georgia College. We really want to incorporate VR Journalism in our courses and this MOOC helped us identify challenges, equipment ethical proponents to the new technology and processes of VR",
		"The theme of the course is most relevant for my research area.",
		"This is a new area of journalism that I would like to pursue further",
		"VR and AR are emerging in the world not only in journalism, but advertising, film, and the gaming world. I wanted to stay current so that I can keep up with my peers as I delve deeper into the field",
		"It is a topic I am interested and the instructor was very clear",
		"It was a topic I had little previous experience but a lot of interest, so it worked well for me",
		"This course affirmed my interest in data journalism and desire to enter the field",
		"I was at the time coordinating a data storytelling webinar series so I was very open to different perspectives so I could add it into my work. I added more data resources based on the course.",
		"I was really interested in data journalism and I wanted to know just how much of the concept I had grasped; and to know what areas I had not properly understood so I could work on them",
		"My interest in the subject and the oppotunity to teste myself. The exercises were a way to practicing what i learned",
		"The main motivation was that I wanted to learn about data journalism. I watched the videos and read all of the recommended texts",
		"The subject is interesting in many levels but mostly professionally so that was a big motivation",
		"Interested in the topic Want to learn. Interactive and example driven",
		"My interest in the topic was my primary motivation for taking this course. I tend to learn best from reading and/or viewing so the articles and videos worked for me",
		"My son (10 years old) and I were doing the course together. We wanted to finish all the lessons to feel that sense of completion and learn as much as possible about VR/AR",
		"What motivated me to complete the exercises was that I'm teaching online journalism, and researching VR narratives, that's why I was completely motivated",
		"I enjoyed them. I was learning something I wanted to learn (and a few extra things, like shortcuts, that I hadn't expected",
		"i frequently work on data similar to that in the course, and i am trying to transition to Jupyter/pandas to analyze data, so i was highly motivated",
		"It's a helpful and newly topic for me",
		"The fact that I really wanted to know the functions presented",
		"The most important motivation is naturally my interest in the subject",
		"I had no familiarity with campaign finance disclosure portals and was curious as to how go about finding and navigating them",
		"Since the topic is new for me, I am interested in exploring all the things that were explained in the class.",
		"I donAt know much of code but I love journalism. The course make me start a python course. I think the exercises are very helpful cause we can practice what we see in the theorics and the course work helped a lot with work i was doing on my own data",
		"learned from clear examples given in course about ethics and bias of certain kinds of analysis, why they are problematic and how to avoid inadvertently coming to unethical or biased conclusions.",
		"great case studies of the fictional town in Australia",
		"It was a very good introductory that took me through a lot of starting steps. very helpful",
		"One great example was when we were walked through step by step on using tools for data aggregation",
		"I had just taken a developer course in Tableau -- so it was GREAT to see how Heather Krause worked with data -- and very helpful to understand the difficulties in getting good, decent data, how and why to keep data documentation, and how she used Tableau to visualize data exploration. Best of all was the sharing EVERYONE did -- Alberto, Heather, and classmates",
		"What I enjoyed most was the ideas on how to tell a story OR how to find an angle for your study by examining the raw data. I learned how complex the use of free and open data sources can be with all the concerns over validity of the data, etc.",
		"Good content, interesting topic and great instsructors",
		"A lot of it I've already covered before but even the review is useful and different examples & presentation make it interesting",
		"As a first MOOC course I have taken it has given me much of grading up the knowledge I have already had from my home institution which I have forgotten during the years. It was also really fun to participate in this kind of course with so many students from different parts of the world",
		"Because it ws nice and handson and practical.",
		"Content, tips and relevant information that actually contributed to improve my skills in data journalism, in Tablaeu software, in Excel",
		"Exercises, lectures, reading materials were all excellent, challenging yet manageable",
		"Great contents, awesome instructors. Muy best MOOC",
		"I did not expect so much focus on data visualization, and statistics; I have never considered learning tableau and now I am; I did not even know about R programming, and it is on my \"learn\" list. It offered me new opportunities to learn and think.",
		"I learned interesting things and instructor showed me some great tricks and knowledge",
		"I like the topic. The level is challenging just enough, but accesible. The instructors are good at transmitting their knowledge, and the rhythm was engaging",
		"I take data and turn it into stories. I felt that this course and others like it help me to do that more efficiently and with greater skill. I especially appreciate all the examples of poor data presentation and why those make for a poor and misleading visualization",
		"I think the course covered many aspects of the topic and was very relevant. Teachers were great. As a designer, a lot of it was not directly relevant to my day- to-day job but very interesting none the less. I wish more time would have been spent on visualization/design",
		"The live lesson was great",
		"I was fulfilled at the end of the course because I actually achieved my aim of getting enriched with pa new knowledge",
		"Interesting and inspiring",
		"It fullfilled all my expectations. It had great content, expertise from the instructors",
		"It served as a good introduction on how to explore, interpret, and communicate a story that is based on data",
		"It. helped me to combine interest my interest in science , writing and storytelling",
		"New concepts very clear explained",
		"The course presented an interesting perspective on storytelling with data. The instructors were very good",
		"The instructors were available to talk and contribute, the content was really good",
		"The language used in teaching this course is simple and easy to understand. Examples used are relevant and easy to digest. The pace is appropriate for me.",
		"Particularly like the \"ethics\" section at the end of each module",
		"The video format, cut into a series of small chapters, is lovely and easy to follow. I really enjoyed getting the perspective of the instructors, particularly because I have a lot of respect from them as professionals. I also appreciated learning about other projects in the world (the examples that were discussion topics/assignments) and seeing how others approached them",
		"This course gave me some great tools for thinking through information and presenting it effectively as well as an understanding of the ethics of communication. I also appreciated the independent learning, the expertise and personalities of the instructors, the input of more advanced students, and my new awareness of modern educational methods",
		"Though I haven't finish the MOOC, the course was very instructive on three main topics: where to find data, how to organize and clean this data and how to build different ways to tell the story behind it",
		"Very easy and useful",
		"Very relevant and complex- yet broken down in attractive ways",
		"found very good stuff, very good advises and tips",
		"I had already produced a few journalistic stories in 360 video and was working on a few 360 interactive projects when I began this MOOC. The course and content, as well as tips really helped me deal better with production techniques and planning",
		"An interesting lecture with the latest developments in the issue but, at the same time, with the historic context and evolution of Immersive Journalism. Really good technical explanation and software/hardware suggestions and recommendations",
		"Excellent course",
		"Excellent explanation of the teacher and the thematic dosage of the course",
		"Explaination precise and clear",
		"Good topic, Great materials, inspiring discussion",
		"It served as a primer on immersive journalism and provided a good sample of gear available and production techniques. The instructor did an excellent job of presenting the materials, sharing hands on experience, and moderating discussions",
		"It was a good introductory course to the subject. There was enough grounding information without being overwhelming, the instructor was energetic and engaging and above all, I appreciated the reading material, it was in-depth??? and thoughtful",
		"It was a great course with great material and interation",
		"It was the first time I was exposed to these technologies in such depth.It was easy. Not difficult. The examples were great. I especially loved the videos in Module 4",
		"Simply... The course is great",
		"This was an excellent overview and introduction into the world of VR and AR. (I do wish there had been a bit more talk about the difference between the two, which I believe will be a critical distinction). I like the hands on videos from the excellent instrutor, who is an authority on VR in his own right",
		"Fun to do",
		"Useful content, and it was doable in the small chunks",
		"Easy to follow course, used real data in examples and exercises to demonstrate real world application of skill",
		"Excellent intro to Python. Have tried a few other introductory courses but this one has made it stick. Also, teaching the integration into github was great, makes working collaboratively so much easier",
		"Excellent straightforward instruction about use of python & jupyter notebook, illumination on data reporting",
		"Great explanation of each and every step of the data analysis",
		"Great introduction to Jupyter Notebook and Pandas. Very easy to follow along",
		"I have been wanting to learn this for a while. It is easy to get hung up on the technical setup before you get to code. That was totally taken care of by this class. He made it so easy. I just wished we could keep going",
		"I think the course had a great learning curve, it was easy to follow, the instructions were clear and it was very well explained, giving insight into how coding works",
		"Hands on experience, getting to perform a real analysi",
		"I'm just beginning to learn about data analysis and data visualization. This was a great intro for me",
		"It got me started with python at a good pace",
		"It is very difficult to find quality and up to date getting started tutorials that are complete",
		"It was nice and simple to follow and it was a topic I knew little about",
		"It's very well done and lays out the information in a simple-to-follow way. I have some background and previous experience with Python, but I still learned some great ways to make data analysis easier. Ben is approachable and friendly, as well",
		"the world of coding is compeletly new for me but this course make learning coding from scratch less intimidating as i imagined",
		"Again, its seriousness",
		"immersive approaches",
		"Practical examples and templates such as the data dictionary, although it is a minor thing, but specifying such things really made it stick in my head",
		"Although I love knowing the gory details eventually, I am someone who learns more by running code and watching what happens. Using the code from the class I was able to build on it because I could see what it was doing. There are people who learn step by step, but, for whatever reason, I learn best when I have an overall picture of what I can do - then I go back and fill in the pieces. So, for example, when we imported data from an outside source of our choosing, I took the working code we were given and was able to google and search for additional functionality so that I could import a directory of files and automatically append them. If I hadn't been able to see how the import works by having the working code - if I had spent all my time just getting the initial import to work I would not have had the understanding and the time to augment that process. It was an awesome \"leg up\" on the process. That and the excellent installation instructions - installation can stop me in my tracks. I had previously installed Anaconda but the directions were so clear, I was able to alter things to fit my situation",
		"The combination of very clear notes in the course Notebook and super well- paced, clear and accessible videos was outstanding. I can't think of a single occasion where I didn't understand or couldn't find the answer I was looking for"
	],
	"negative": [
		"a rather bad example is that interesting information in the fora become difficult to be noticed because after a couple of days there are so many contributions that it becomes almost impossible to read through them, let alone pick up something interesting and learn something new",
		"Negative indications that the discussion forum was not helpful or less effective than live discussions",
		"Discussion forum participation was lackluster. Everyone creating their own thread and posting the required short answer to the prompt led to effectively no discussion. Would be better to have threads on specific topics/questions and encourage thoughtful debate/discussion",
		"discussion forum questions did not give too much interaction. could they be reprashed requring more of this",
		"Feeling too visible on the internet (having a profile and taking part in discussions on the site",
		"i wish i could get my certificate without the forum participation. i completed every exercise",
		"Sometimes, given personal commitments there was not enough time for me to participate fully in the discussion forums. I also was intimidated by some of the very well crafted comments from professional journalists and was not sure that any of my contributions would be useful since my knowledge was so basic. I also",
		"wish there was some way to pull out files for the comments since it is tedious going through all the names of individuals and comments",
		"I feel that a live discussion is much better than the virtual forum. On a face-to-face we would have a discussion after each presentation which would have helped a lot",
		"Peer forums do not offer engagement on par with F2F instruction. One usually gets opinions on the topic at hand and while that can be interesting, but it's not usually very informative a. Most people are not able to give constructive critique, so it's not really very helpful",
		"Having the requirement to engage in discussion - I am quite the introvert so that was hard for me",
		"i didnt participate in the forum",
		"The forums were not as successful as they might have been",
		"It was a thought provoking course. I just think the execution of the course could have gone better. Discussing in the forums wasn't the best use of time. I would have rather had more quiz questions",
		"As I said, the way to learn should be more interactive. Not just linked to the discussion forum, which can't demonstrate the skills or the knowledge you have learned",
		"I don't like discussion forums, they are impractical and the interaction is practically nil. I don't find sense to do the quizzes, especially if you can correct answers that the quizz itself gives you",
		"The interaction/participation part, like I mentioned before, was frustrating",
		"Although the forums permite us to exchange ideas, I had difficulties to participate and use them. I think they are confusing. Maybe, it is a thing to work better",
		"Perhaps there were too many students. Sometimes questions got buried under ton of discussion sessions",
		"The most challenging part is writing forum posts. I tend to think my english is not good enough",
		"Did not complete all forum comment assignments due to time and didn't have any comments or different opinions from those already shared. I didn't want to post a \"yeah, me too\" or 'Yes, I agree / don't agree with...\" comment",
		"Felt I could get what I needed from the course without actively joining in discussion forums",
		"I found participating in the forums to be annoying, often times I would complete the course after the majority and didn't have much to contribute, as others stated most of my points",
		"Learning effect of discussion forum seemed not worth the time",
		"Not liking to participate in the discussion questions",
		"Sharing on the forums seemed less relevant, since I'm not actively involved in journalism",
		"I do not like to participate in the forums and I think this should not be taken into consideration when issuing the certificate. Just this",
		"I didn't do the forums because the conversations tend to be forced on technical topics and repetative",
		"i didnt participate in the forums bc i found out about the requirement too far into my coursework",
		"Complicated schedules, excessive lack of time to carry on",
		"Did not have time to complete exercises on schedule",
		"I do find the exercises helpful in the learning process but lack the time",
		"I got through a lot of reading, notes, videos, forum stuff. Then there was not much time left for practicals. I found the time estimate an underestimate",
		"I realised I could easily need several hours at weekends to do exercises, and it was not fitting together. At a fortnightly pace I might have fitted it in",
		"I want to complete all the courses which I have enrolled but my time schedule isn't permitting me",
		"It was due to my work load and travel changing. I will take the class again next time it is offered. I did learn several things so it was not a waste",
		"Not able to organize study/work time during that period",
		"Part way through the course I became ill so got behind",
		"My specific problem was the lack of time for the workload, in any case, I should organize myself better, but the MOOC model seems to offer all the necessary learning possibilities, it would not change anything",
		"This is on top of full time job, 2 - 3 hour commute, plus domestic bits some there were limits to what I could do in the time",
		"Discipline to meet schedules",
		"I did not try the software to handle data because of time constraints (I took several moocs at the same time",
		"It was a bit hard to keep track with the schedule bcs of other work but it went well",
		"It was difficult to have free time to take the course",
		"Making time to read and view all the materials, and complete the activities, was challenging but worthwhile",
		"My challenges have been of time and in some instances on complexity of the new tricks to be learned and practiced",
		"My own study/work balance at that time",
		"My poor knowledge in maths and data analysis is a challenge that I had to face and I need to improve it to take advantage of this type of MOOCs",
		"Taking time out to participate in the course on schedule and to participate in the discussion forums on time",
		"The challenges I had were not related to the program but rather a lack of time on my part, which prohibited me from doing more",
		"There's so much to learn and not enough time! But I'm not sure that's anyone's fault",
		"Time",
		"Time was my challenge, but without challenges how do you learn. There were things I had no knowledge of, but learned. I like to go out of my comfort zone and learn new things. This was out of my comfort zone, but instead of dropping out, I just kept up the best I could and learn what I could. The next round will be a challenge, but I have some knowledge behind me so I will pick up on other things. Well worth my time",
		"Time. I found 5 hours a week to be an underestimate, especially as the course progressed. I got through readings, videos, note making, quizzes, forum stuff, but not practical exercises, and there came a point when I could not keep up. Fortnightly pace might have suited me better. 2. Had I laptop for the data exercises, instead of a desktop, I might have stood a chance of doing those exercises when my heating failed as I could have stayed in the one room that was smallest to heat. 3. Based on advertised time commitments I tried to alternate this MOOC with another course - a mistake",
		"Working schedule is fluctuating, but the course demanded to submit a particular evidence to prove my studying like posting own opinion on the board etc. I know cramming results in low quality of learning, but sometimes we need it as we are not full time students",
		"As it gets more complicated toward the end, I just run out of time",
		"Could not participate due to work conflicts but hope very much you will re-offer",
		"Fairly limited time period",
		"hard to find time to complete",
		"Having too much MOOC's work is OK, but when you are working professional, sometimes you have to travel or special assignements, and you are delayed a week, and then is very diffictul to catch up. It was my case, I had a business trip and I missed the last module. I was not able to catched up later",
		"I was sorry I didn't have the time to invest fully in the course",
		"t came at a time when i was super-busy with conferences and other activities, so i did most of it on a single day",
		"Just that I had limited time to commit to an online course",
		"lack of time to check all the inforrmetion",
		"Lack of time to fully participate",
		"Lack of time to spend more time \"playing\" around with date to increase personal skillset (but that's not the course's fault",
		"Me not having the time to carry on",
		"No time at all to study course, just uploaded videos and reading materials",
		"Adjust the times of my professional activities to be able to take the MOOC",
		"Had I been more engaged I know I would have gotten even more out of this. Online learning (and all learning at that) is what you make of it. It was too easy for me to lag and then I tried to catch up all at the end. Not the most effective way to learn. _Thank you for creating this program though. It was really awesome",
		"Like most working people, making time for additional activities during any given week is a challenge. Also, my iPhone 6s did not perform as well as I would have liked it to when attempting to view examples of immersive journalism. Fortunately, my son has a Samsung/Android smartphone, which performed better in some cases",
		"My greatest challenge was my time. P.S. If I had gotten this survey right after the course, I probably would have remembered more examples for the questions above",
		"Keeping up with the weekly lessons and finish the course are true challenges. I always try to follow the agenda but never succeed. So it is good that participants get the chance to finish it following more or less their own pace. On average, the subject was quite challenging, so things asked in the course were not done in 1,2,3. Also the coding needed concentration",
		"Only really challenge for me was time, because a few things converged in my life that meant I didn't have as much clear headspace for this as I'd hoped. Among other things, a journalism conference I was helping organise started to ramp up about this time and took more bandwidth than I'd anticipated. #rookie",
		"the biggest challenge was finding time - i was away for significant portions of two of the weeks, so i did a lot of it in the final week",
		"Bad: difficulty to organize my schedules to carry out the activities",
		"Bad overlay timing wise, but hope you will re-offer! Very impressed with the coordination",
		"Didn't have time , and mostly cared about the theory ",
		"Difficulty managing the time and demands of billable hours / work and dedicate myself with attention to the content taught.Difficulty managing the time and demands of billable hours / work and dedicate myself with attention to the content taught",
		"Doing too many things in the same time period: full time job and other courses. Also I was unwell for part of the course, and had heating problems during a cold snap and could not think in 13 or 14 degrees max room temp; this also limited my desktop computer time. I spent most of the time on the videos and readings and notes, then did quiz and forum postings, then if any time left did practical exercises. I soon gave up the other course I was alternating with this one - or rather saved all materials for later learning and use. Domestic stuff also took too much time. Would have preferred more spread out units",
		"Had do drop after lesson two or three due to lack of time and urgent work load. Did so with lots of regretting",
		"Again, because of the time. I was not able to take the Module 5 because I had a bussines trip. The original information we had was that we had one more week to catch up (until March 5th or something like this). The following week was very busy for me, so I was really disappointed (with myself) because I did not finish and because -even if I really wanted- I was not able to get enought time to work in the last module of my MOOC. Then, around March 27, I got an email saying that we have until March 31 to catch up (again a very hard working week). So, I was dobly disappointed because I did not get this information on time. I mean, I am sure that I would have got the time to do it (between March 6 and 31), but I did not know that it was still possible to reach the target",
		"Because I didn't take the time to complete all assignments",
		"I couln't follow all the classes due to lack of time, but the few I watched were very interesting",
		"I did not have time to participate enough",
		"I didn't apply myself as fully as I would have liked. Despite the flexibility, which was great, it was hard to find an appropriate amount of time to put into the cours",
		"I didn't end up having any time to do the course. I was supposed to be given time to study, but then extra urgent work occurred",
		"I didn't have enough time this time for this course and also the content is quite technical and i need more time to practice",
		"I didn't learn much because, as I have said, I didn't have time to follow it properly",
		"I got overwhelmed with all the information and trying to learn the new tools while working full time and having a full schedule of medical apointmnents etc",
		"I have learned a lot when I was being able to follow the course. I am sorry I had to quit. I will get back to it when work gets less busy. I did not manage to work well with Tableau, though",
		"I was so busy and time flew by so soon I literally didn't have time to prticipate. But it was also incredibly hard to stop the emails from coming in via mobile. It got very annoying at one point",
		"I was unable to complete it because work became very busy and so I didn't learn as much as I had bhoped",
		"Interesting course. I just was not able to commit the time to get a lot out of it",
		"I needed more time",
		"Lack of time",
		"Time management",
		"It was my problem, i did have enough time to do it",
		"Lack of time",
		"Lack of time (due to family events) and could therefore not go in-depth",
		"Loved the course - could have learned more if I took the time to really play around with the data sets. You get what you put in",
		"My schedule changed and I could not get passed the second module, unfortunately. Everything in the course seemed to be well-designed and managed, so i have no complaints. It was my own lack of time that stopped me from learning",
		"No time at all to study course, just uploaded videos and reading materials. But i know that i will learn a great deal when i have time to study the materials",
		"Obviously, it's hard to enjoy fitting more work into a busy schedule, but it will help me out at my job",
		"The course is very interesting and the knowledge it provides is very useful. The instructors really teach and we can learn by the way the MOCC's are structured. In my personal case, I did not have the time and the mental availability to complete the course, but I want to do it in a second edition",
		"There was too much material (outside of the videos). I am time-starved and could not prioritize",
		"Time",
		"timing turned out to be challenging for me- i wish i could retake this course at a",
		"different time",
		"Tive dificuldades em me disciplinar para os cursos. Mas pretendo continuar me inscrevendo para estudar online",
		"I did not have much time to practice with the data sets and Tableau or Excel. It would have been good to have a list of suggested references for those two applications (software) that we could use to continue expanding our skills after the end of the MOOC",
		"Would have learned a great deal if I had the time",
		"limited time",
		"No time",
		"Not enough time",
		"Having taken a Knight MOOC before, I knew I probably wouldn't get to the discussion much if at all because of time restraints but would focus on reading, videos, quizzes",
		"I downloaded all the info with the intent of going through it all when I have more time",
		"I knew from the start i wouldn??t be able to do it all yet wanted to get as much out of it as possible. I will try to continue to go through it",
		"I need more time check and complete the exercises. Is possible to never close this course, because is good to check all the information with relax time",
		"I thought I could devote more time, I have to commend the seriousness and scope of course",
		"It was a busy period in my work, I completed half of the exercises and then I had to stop",
		"Misunderstood when I had to complete then realized that it was extended - but by that time I had no time",
		"My work demanded me too much time and I had to quit the course, unfortunately, because I was loving it",
		"Picked up a major project at work that took more time than usual",
		"started a Master, so I was really short on time",
		"But I hope complete all during next weeks",
		"I am hoping to complete the final forum assignment soon",
		"Not enough time because of day job",
		"Didn't have the time despite the latter modules being why I signed up",
		"I did not have time to work on my data with tableau, but plan on doing so within the next two months",
		"I was finally buzy with the peak f the term and could not spend time when I thought it would be possible for me. So, the mountain to identify a topic and database because a burden",
		"initially time was tight to complete the",
		"lack of time",
		"No time",
		"No time at all to study course, just uploaded videos and reading materials",
		"no time to finish",
		"None really... just became overwhelmed with other work",
		"no time to see it",
		"Time pressure",
		"I didn't like the fact that the course was mostly based on 360 videos and not in real VR projectes, like The Guardian 6x9",
		"The course itself was great in a lot of respects, but I sometimes felt uncertain of what I needed to do beyond watching the videos and downloading Tableau. More importantly to my experience is that once I fell behind a couple weeks, I became felt like I could never catch up, so sort of gave up",
		"Some aspects were too repetitive but otherwise it was ok",
		"Great simple step by step.I wish a data set would be supplied or linked to",
		"I feel it was ALOt some of us are working, so it's not easy at all and considering our different time zones, the hangouts were at odd times",
		"I learned a fair bit about cleaning my data and finding important stories, but I felt that I was really falling behind at the weeks progressed because the instructors discussed statistical concepts I was not familiar with. I felt I had to do my own research in order to keep up",
		"I t was tasking",
		"Learning progress (learned tasks vs what will be learned) not very clear. I mean user interface",
		"Maybe it was because I was not really part of the target audience, but I was expecting more from the storytelling part of the course.",
		"The content was very useful but became to technical and boring by times",
		"The MOOC platform for this course has the worst User Experience I have seen. Sorry. I have been a participant on more than two dozen MOOCs with certifications, so I know what I'm talking about. The UI looks ancient, sometimes with confusion buttons. The material is not easily accessible. While the content was good, I believe it was held back by the poor choice of MOOC platform",
		"There were some things I learned, but not as much as I might have hoped",
		"Very good in-depth treatment of subject matter; however, not so technical so as to lose the audience. I was able to take screen shots of the presentation and created my own PowerPoint presentations that serves as a valuable reference and research subject material. I would be very helpful if there was a way for all the course to have been easily saved with all the videos, and reference materials",
		"Not enough tools to continue learning. It did not teach a language, just some excercises",
		"not what I thought",
		"topic was not as relevant as I had hoped",
		"The content was very repetitive and the instructor didn't add new information or knowledge",
		"Again, just too much info and a weak wrap up to course; I know instructors are very knowledgeable",
		"Complexity",
		"I found the Tableau bits slow and boring",
		"No background information about the relationships with the traditional journalism",
		"Nothing was wrong, it just felt like half the material should have been in Module 3 and half in Module 5 ",
		"The MOOC platform",
		"Volume of tasks in the time available. Module 4 is about where I derailed. I had catching up to do from about Module 3. I did that. I eventually did Module 4, then tried to catch up Module 5 and was part way through that at the end of the course",
		"Basically, you only know what to do followed the videos. But don't know \"why to do so\". And what if not, what if else. More basic introductions to Python would be better",
		"Course pacing",
		"I wish it could have been unpacked more",
		"Pace was a little slow in that module",
		"Please use INFORMATIVE subject lines in messages. I DO NOT use Facebook (by choice) so I felt disenfranchised that Facebook was a main way you were distributing real-time interaction/content",
		"The content was not bad. But it was too scarce. If we had more content on this module we could have had the other two optional chapters of the book",
		"Too much information to grasp in such a short time",
		"Too much, too quick",
		"Didn't end up with I had expected",
		"It didn't teach me a lot I hadn't learned on the job",
		"To be honest, I was mainly happy to get current insights into my home country's political situation and how it is perceived by journalists. I did not learn any technical content",
		"Sometimes materials are repetitive",
		"The UI of the MOOC software is a little odd. Each class was labeled the same so it was easy to get lost. Other than than nothing particular",
		"again, the main page is poorly laid out, and confusing. The structure, what there is, is confusing ‰ÛÓ at best",
		"evaluation metrics too simplistic",
		"As said earlier, not enough practical application in the form of news stories or data projects. The only applications the course offered weer multiple choice quizzes and peer reviews, which, in myopinion, were no substitute",
		"Formatting of the outline was hard to read. Hard to tell where I was in the course each time I returned to the MOOC",
		"hands on needed for this topic I think",
		"I strugged with Tableau and needed that to be more directly incorporated into the course",
		"I think this particular course needs more practical exercises",
		"the layout of the class page is horrible. I was guessing how to get through the course, and I'm sure I missed information",
		"Too many difficult content for not too many time",
		"Navigating the interface, especially via mobile devices (iPhones specifically",
		"The challenges was first about how to learn in that kind of course, because was my first experience of doing that. Also, systematize the knowledge in order to transmit and apply to other people. During the course, be able to talk and to write about the subjects",
		"You might consider combining an information gathering/evaluation course, with a data viz or alternative media course, both taught at the same time and both requiring students to take both, with a fee for both. This could build some communication within the student cohort and help steer the finished result to a more satisfying conclusion. With the current mess here in the U.S. politically, we need people to be able to think first and do all the exciting graphics, podcasts, etc. second. Please keep that in mind for future courses. And don't be afraid to charge, or ask U.S. and European, employed students, to pay for classes to help provide them free for journalists in much less secure places, where just writing the truth is dangerous. _Thanks for asking for this feedback",
		"In this MOOC, we used Tableau software without introductory base. It was not hard to follow, but I didn't understand a lot of what we did then. Maybe the MOOC should have included some optional basic introduction to Tableau before using it",
		"It was a challenge to get all of the reading done each week. I fell behind with the reading at times but I liked that you could still go back and get into the readings and I was able to save them after the class ended so I would be able to look back at them",
		"I already know R, so I don't need much explanation of data analysis concepts, so felt that some of the videos could have been a little faster paced, but that's probably just me",
		"I thought some parts moved too quickly considering it was supposed to be an introductory class. I felt that I had to do my own research (other online courses, my own readings) in order to keep up with the course. Instructors were assuming audience had a certain knowledge of statistics and used statistical terms without explaining them",
		"length should be 6 weeks - a week 6 wrap up",
		"pace of videos was too slow",
		"There was no final project",
		"too much work compared to the course timeline",
		"It would have been helpful to link in the readings with what was being presented",
		"Quantitative MOOC requirements often seem embarrassing because your answer after seven similar ones given by other people seems so redundant",
		"The huge size, no true assignments, way too much content for length of course, etc. It was not up to the usual Knight standards",
		"There was plenty of very interesting material to study and there was not enough time to cover it all. Being new to the subject, I found myself overwelmed with sources and tools. In spite of the challenge, I consider being able to expand on the knowledge of the course a big plus",
		"For some campaign finance data problems it would help if we could have accounts on amazon aws or google to run jobs that won't fit on laptops. This is because some of the data cleaning involves machine learning code for which you might want to not be limited by laptop ram. This would allow journalists and their data helpers to attack really hard problems and reveal connections that are traditionally intractable because the data are scattered and messy. If my frustration comes through, it's because I speak from sad experience",
		"the class-within-a-class was confusing. I was accepted, but never quite connected with it",
		"I struggled with the technical aspects of using Tableau: I just didn't have the time to get my hands dirty experimenting with it AND complete the course work. It ended up being a case of either or, so I concentrated on the quiz and the forum discussions",
		"Video on using Tableaux went so fast that it was tedious to have to keep stopping to try out the software. Also the software Heather used often didn't match my free version",
		"I liked a lota????o but I am Stilo in doubt about wich equipment purchase and how to operate It practically and How to eddit",
		"because I couldn't even get started due to poor instructions and lack of assistance",
		"There are some prerequisite for this course and did not get through to it so all course is dependent to installations so on that stage you need a technical expert or staff to at least come online once, using team viewer is also a good option for newbie. I suggest you to please look into this matter for best results of online course",
		"I found it confusing/difficult to follow some of the things that were being done in Tableau. I'm new at using the software, though -- so a little frustration is to be expected",
		"Data Exploration with Tableau was helpful, but difficult to follow at times. Some of the terms in data science around causation were difficult to discern",
		"Have not made a 360 video or at least tutorial of how to make it",
		"Technical explanation about recording",
		"The variation in abilities was huge, so in terms of the technical aspects of, say, coding, I couldn't follow or make use of what was being discussed",
		"There could be more content on narrative VR and examples of how to create the storyboard",
		"Was unable to upload Tableau Public to my computer, so lacked experience in that, but was excellent nevertheless to learn of its potential for the future",
		"it (MOOC) only works for information delivery, not practical training like actual analysis with dedicated software requiring high level experience.",
		"One bad thing was I had trouble pushing to Github because I had 2-factor authentication and it was hard to get help in the moment. I eventually figured it out but it took some time.",
		"For some very technical part or let's say the usage of the software in designing graphics I cannot get hold of it completely. It indeed requires practices continuously, but in daily reporting, this is not practical",
		"I had a problem with the course explaining the outliners on Tablaeu. Mine did not look as they were supposed to and I couldn't figure why.My overall opinion of the course is that is a great mooc and I have already suggested it to my students and fellow colleagues at the channel that I work! Good Job",
		"My challenges had to do with using Tableau, since I was a beginner. Also, I struggled with some of the concepts Heather discussed in defining causation and how careful you have to be",
		"Some of the instructions and set up were not clear. I don't remember all the details now, but trying to to read other students' papers was complicated by misleading instructions of how to access the material. I got something, but it wasn't complete and so my comments the first round were based on incomplete assignments. I did comment about this on the forums",
		"Some yes the steps were not the same in the tableau public version or fields were not present as in the instruction. This was especially true as the course progressed",
		"The biggest challenge was in using Tableau which seemed simpler and more effective when Heather Crause showed, but when he was going to reproduce step by step he could not get the same result",
		"The classes (as a whole) seem to have taken off in the alternative media direction, which is interesting, but the teachers have far fewer skills at teaching than the veteran journalists who have taught other classes. Just like in the working world, the skilled experienced older people (journalists) were traded for the up and coming, younger and far less skilled (at working with people, getting information, etc.) people. Is there new management in the program now? I would think being able to find information and tell the story are always paramount, and the technical skills should be second",
		"There were aspects that got technical and went over my head",
		"I was trying to duplicate the instructor's steps and there was a lot of things that weren't clearly explained or available in all versions of Tableau. Spent a lot of time trying to figure that out",
		"I think much time could have been saved if previous Conda installations would have been acknowledged as valid for th course",
		"It was very slow, but I still don't fully get why we needed a virtual environment (I had to look that up later on the web",
		"I would have liked more depth on Python as to learning the actual language. I just wish that because this was so good I wish that there was more ",
		"virtual environment did not work with prior installation of Conda",
		"very hard the tech stuff for ordinary people",
		"I enjoyed the course but I could not relate much with it because I don't have access to the gadgets, thereby making it look theoretical. I also have challenges with the Internet access here in Nigeria, the videos don't play sometime, and other times, they break off, so I don't enjoy the videos. Also, not all the videos are in pdf, I appreciated the ones in pdf because once there's Internet fluctuations, I just download the file and read from it",
		"could not access it",
		"I learned about the topic, but, as I don't have the equipments to use it, the knowledge isn't completed",
		"anything that required using Tableau software was difficult to complete without two computer monitors. Taking this course on my home laptop was not ideal",
		"The content was very good however, I wasn't able to connect to the live streaming which was a key element to which I want to be able to do at our university",
		"Poor audio quality and background noise on videos; tests of learning points were fun but not that challenging (and didn't say why we were right/wrong",
		"The layout of the main page. It's VERY POOR. There is not really a \"direction,\" and it's easy to get \"lost",
		"Sometimes I am unable to download very important videos which is a bad thing about MOOC",
		"As someone from a developing country and a young reporter. Getting the fund to stream or download the videos was not really easy due to that data prices is way high",
		"My old antiquated laptop that tends to overheat during long stretches of watching videos",
		"Yes, as I said sometimes I am unable to download videos and complete my assignments",
		"It started with difficulties to find n interesting data base, I did not get successful access to the drop box or collective databases also",
		"poor technical quality of some of the videos (echo/feedback during webinar); A lot of time wasted on discussions not pertaining to the topic at hand",
		"software not available",
		"complications with my computer and needing to review previous work slowed me down",
		"Problems with my personal computer",
		"There is need of technical staff to be in touch with course participants",
		"Too many technical problems in the beginning of the course made it impossible for me to carry on ",
		"it's costly to access the devices needed",
		"computer difficulties",
		"difficult to overcome technical problems initially",
		"difficulty posting",
		"Had some issues connecting to GitHub",
		"installation",
		"Installation issues",
		"It's difficult to get computer software up and running",
		"Just some difficults to install previous programms and to get the concept",
		"much to install",
		"Tech issues",
		"technical start up was tricky",
		"The only module where I had technical trouble",
		"use python2 not python3",
		"Configuring my computer was an issue. I had already created a setup with anaconda. This caused a conflict with the setup that Ben envisioned. It ultimately didn't matter, but it did cause some confusion",
		"My only challenge was pushing to Github with two-factor authentication. I eventually figured it out but it made for a frustrating hour or two",
		"Only one technical issue in setting up my environment. This was resolved without too much difficulty"
	]
}
